podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKV40F15.svd.xml
<!--
Devices using this peripheral: 
      MKV40F16
      MKV43F16
      MKV44F16
      MKV45F16
      MKV46F16
-->
      <peripheral>
         <?sourceFile "SIM_MKV40F15" ?>
         <name>SIM</name>
         <description>System Integration Module</description>
         <groupName>SIM</groupName>
         <headerStructName>SIM</headerStructName>
         <baseAddress>0x40047000</baseAddress>
         <size>32</size>
         <access>read-write</access>
         <resetValue>0x0</resetValue>
         <resetMask>0xFFFFFFFF</resetMask>
         <addressBlock>
            <offset>0x0</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1004</offset>
            <size>0x4</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x100C</offset>
            <size>0x8</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1018</offset>
            <size>0x10</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1034</offset>
            <size>0x14</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x104C</offset>
            <size>0x18</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1068</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <addressBlock>
            <offset>0x1100</offset>
            <size>0xC</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>SOPT1</name>
               <description>System Options Register 1</description>
               <addressOffset>0x0</addressOffset>
               <resetMask>0xFFFF0FFF</resetMask>
               <fields>
                  <field>
                     <name>RAMSIZE</name>
                     <description>RAM size</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>16 KB</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>32 KB</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OSC32KSEL</name>
                     <description>32 kHz Oscillator</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>System oscillator (OSC32KCLK)</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>LPO 1 kHz</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOPT2</name>
               <description>System Options Register 2</description>
               <addressOffset>0x1004</addressOffset>
               <resetValue>0x1000</resetValue>
               <fields>
                  <field>
                     <name>CLKOUTSEL</name>
                     <description>Clock Out Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>Flash clock</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>LPO clock (1 kHz)</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>MCGIRCLK</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>OSCERCLK_UNDIV</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>OSCERCLK</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRACECLKSEL</name>
                     <description>Debug trace clock select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>MCGCLKOUT</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Core/system clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NANOEDGECLK2XSEL</name>
                     <description>Nanoedge clock(PWM 2x clock) select</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>MCGPLLCLK</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MCGPLLCLK2X</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOPT4</name>
               <description>System Options Register 4</description>
               <addressOffset>0x100C</addressOffset>
               <fields>
                  <field>
                     <name>FTM0FLT0</name>
                     <description>FTM0 Fault 0 Drive Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT0 pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0FLT1</name>
                     <description>FTM0 Fault 1 Drive Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT1 pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP1_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0FLT2</name>
                     <description>FTM0 Fault 2 Drive Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP2 OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0FLT3</name>
                     <description>no description available</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT3 pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>XBARA output 49</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1FLT0</name>
                     <description>FTM1 Fault 0 Drive Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM1_FLT0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3FLT0</name>
                     <description>FTM3 Fault 0 Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM3_FLT0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CMP0_OUT</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0TRG0SRC</name>
                     <description>FTM0 Hardware Trigger 0 Source Select</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CMP0_OUT drives FTM0 hardware trigger 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM1 channel match trigger</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0TRG1SRC</name>
                     <description>FTM0 Hardware Trigger 1 Source Select</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB0 output trigger drives FTM0 hardware trigger 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM1 channel match drives FTM0 hardware trigger 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0TRG2SRC</name>
                     <description>FTM0 Hardware Trigger 2 Source Select</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM0_FLT0 pin drives FTM0 hardware trigger 2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>XBARA output 34 drives FTM0 hardware trigger 2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1TRG0SRC</name>
                     <description>FTM1 Hardware Trigger 0 Source Select</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CMP0_OUT drives FTM1 hardware trigger 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM0 channel match drives FTM1 hardware trigger 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1TRG2SRC</name>
                     <description>FTM1 Hardware Trigger 2 Source Select</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM1_FLT0 drives FTM1 hardware trigger 2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>XBARA output 35 drives FTM1 hardware trigger 2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3TRG0SRC</name>
                     <description>FTM3 Hardware Trigger 0 Source Select</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CMP0_OUT drives FTM3 hardware trigger 0</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM1 channel match</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3TRG1SRC</name>
                     <description>FTM3 Hardware Trigger 1 Source Select</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>PDB1 output trigger drives FTM3 hardware trigger 1</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>FTM1 channel match drives FTM3 hardware trigger 1</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3TRG2SRC</name>
                     <description>FTM3 Hardware Trigger 2 Source Select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM3_FLT0 drives FTM3 hardware trigger 2</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>XBARA output 37 drives FTM3 hardware trigger 2</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOPT5</name>
               <description>System Options Register 5</description>
               <addressOffset>0x1010</addressOffset>
               <fields>
                  <field>
                     <name>UART0TXSRC</name>
                     <description>UART0 Transmit Data Source Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>UART0_TX pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART0_TX pin modulated by FTM1 CH0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART0RXSRC</name>
                     <description>UART0 Receive Data Source Select</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART0_RX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1TXSRC</name>
                     <description>UART1 Transmit Data Source Select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>UART1_TX pin</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>UART1_TX pin modulated by FTM1 CH0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UART1RXSRC</name>
                     <description>UART1 Receive Data Source Select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>UART1_RX pin</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
