podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKV40F15.svd.xml
            <register>
               <name>SOPT7</name>
               <description>System Options Register 7</description>
               <addressOffset>0x1018</addressOffset>
               <fields>
                  <field>
                     <name>ADCATRGSEL</name>
                     <description>ADCA Trigger Select</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>PDB external trigger</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>CMP1 out</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>CMP1 out</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>CMP2 out</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>PIT trigger 0</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>PIT trigger 1</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>PIT trigger 2</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>PIT trigger 3</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>FTM0 trigger</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>FTM1 trigger</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>FTM3 trigger</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>XBARA output 38</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Low-power timer trigger</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCAALTTRGEN</name>
                     <description>ADCA Alternate Trigger Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 12</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PDB0 Trigger Selected for ADCA</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCBTRGSEL</name>
                     <description>ADCB Trigger Select</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>CMP1 out</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>CMP1 out</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>CMP2 out</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>PIT trigger 0</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>PIT trigger 1</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>PIT trigger 2</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>PIT trigger 3</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>FTM0 trigger</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>FTM1 trigger</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>FTM3 trigger</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>XBARA output 41</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Low-power timer trigger</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCBALTTRGEN</name>
                     <description>ADCB Alternate Trigger Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 13</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>PDB1 Trigger Selected for ADCB</description>
                           <value>0b01</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
