podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKV40F15.svd.xml
            <register>
               <name>SOPT9</name>
               <description>System Options Register 9</description>
               <addressOffset>0x1020</addressOffset>
               <fields>
                  <field>
                     <name>FTM1ICH0SRC</name>
                     <description>FTM1 channel 0 input capture source select</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM1_CH0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0_OUT</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>CMP1_OUT</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1ICH1SRC</name>
                     <description>FTM1 channel 0 input capture source select</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>FTM1_CH1 signal</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Exclusive OR of FTM1_CH1, FTM1_CH0 and XBARA output 42</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM0CLKSEL</name>
                     <description>FTM0 External Clock Pin Select</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM0 external clock driven by FTM_CLK0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>FTM0 external clock driven by FTM_CLK1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>FTM0 external clock driven by FTM_CLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM1CLKSEL</name>
                     <description>FTM1 External Clock Pin Select</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM1 external clock driven by FTM_CLK0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>FTM1 external clock driven by FTM_CLK1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>FTM1 external clock driven by FTM_CLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FTM3CLKSEL</name>
                     <description>FTM3 External Clock Pin Select</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>FTM_CLK0</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>FTM_CLK1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>FTM3 external clock driven by FTM_CLK2 pin</description>
                           <value>0b10</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDID</name>
               <description>System Device Identification Register</description>
               <addressOffset>0x1024</addressOffset>
               <access>read-only</access>
               <resetValue>0x40600100</resetValue>
               <resetMask>0xF0FF0FF0</resetMask>
               <fields>
                  <field>
                     <name>PINID</name>
                     <description>Pincount Identification</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>48-pin</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64-pin</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>100-pin</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIEID</name>
                     <description>Device Die Number</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>REVID</name>
                     <description>Device Revision Number</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>SERIESID</name>
                     <description>Kinetis Series ID</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Kinetis K series</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Kinetis L series</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>Kinetis W series</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Kinetis V series</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUBFAMID</name>
                     <description>Kinetis Sub-Family ID</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>KVx0 Subfamily (FlexTimer &amp; MC_ADC)</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>KVx1 Subfamily (FlexTimer &amp; HS_ADC)</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>KVx2 Subfamily (Reserved)</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>KVx3 Subfamily (eFlexPWM &amp; MC_ADC)</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>KVx4 Subfamily (eFlexPWM &amp; HS_ADC)</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>KVx5 Subfamily (eFlexPWM with FlexTimer &amp; MC_ADC)</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>KVx6 Subfamily (eFlexPWM with FlexTimer &amp; HS_ADC)</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FAMILYID</name>
                     <description>Kinetis Family ID</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Kinetis family of this device. This is the Vseries</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCGC4</name>
               <description>System Clock Gating Control Register 4</description>
               <addressOffset>0x1034</addressOffset>
               <resetValue>0xF0000030</resetValue>
               <fields>
                  <field>
                     <name>EWM</name>
                     <description>EWM Clock Gate Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EWM" > <name>I2C0</name> <description>I2C0 Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART0</name> <description>UART0 Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>UART1</name> <description>UART1 Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>CMP</name> <description>Comparators Clock Gate Control</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>eFlexPWM0</name> <description>eFlexPWM submodule 0 Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>eFlexPWM1</name> <description>eFlexPWM submodule 1 Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>eFlexPWM2</name> <description>eFlexPWM submodule 2 Clock Gate Control</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="EWM" > <name>eFlexPWM3</name> <description>eFlexPWM submodule 3 Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC5</name>
               <description>System Clock Gating Control Register 5</description>
               <addressOffset>0x1038</addressOffset>
               <resetValue>0x40182</resetValue>
               <fields>
                  <field>
                     <name>LPTMR</name>
                     <description>Low Power Timer Access Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Access disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Access enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PORTA</name>
                     <description>Port A Clock Gate Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PORTA" > <name>PORTB</name> <description>Port B Clock Gate Control</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTC</name> <description>Port C Clock Gate Control</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTD</name> <description>Port D Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>PORTE</name> <description>Port E Clock Gate Control</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>ENC</name> <description>no description available</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>XBARA</name> <description>XBARA Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>XBARB</name> <description>XBARB Clock Gate Control</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>AOI</name> <description>AOI Clock Gate Control</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="PORTA" > <name>ADC</name> <description>ADC Clock Gate Control</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC6</name>
               <description>System Clock Gating Control Register 6</description>
               <addressOffset>0x103C</addressOffset>
               <resetValue>0x1</resetValue>
               <fields>
                  <field>
                     <name>FTF</name>
                     <description>Flash Clock Gate Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="FTF" > <name>DMAMUX0</name> <description>DMA Mux Clock Gate Control</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>CAN0</name> <description>CAN0 Clock Gate Control</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>CAN1</name> <description>CAN1 Clock Gate Control</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>FTM3</name> <description>FTM3 Clock Gate Control</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>SPI0</name> <description>SPI0 Clock Gate Control</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>PDB1</name> <description>PDB1 Clock Gate Control</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>CRC</name> <description>CRC Clock Gate Control</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>PDB0</name> <description>PDB0 Clock Gate Control</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>PIT</name> <description>PIT Clock Gate Control</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>FTM0</name> <description>FTM0 Clock Gate Control</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>FTM1</name> <description>FTM1 Clock Gate Control</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="FTF" > <name>DAC0</name> <description>DAC0 Clock Gate Control</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>SCGC7</name>
               <description>System Clock Gating Control Register 7</description>
               <addressOffset>0x1040</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>DMA</name>
                     <description>DMA Clock Gate Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clock disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clock enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
