podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKV40F15.svd.xml
            <register>
               <name>CLKDIV1</name>
               <description>System Clock Divider Register 1</description>
               <addressOffset>0x1044</addressOffset>
               <resetValue>0x10000</resetValue>
               <fields>
                  <field>
                     <name>OUTDIV4</name>
                     <description>Clock 4 Output Divider value</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0000</name>
                           <description>Divide-by-1</description>
                           <value>0b0000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>Divide-by-2</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0010</name>
                           <description>Divide-by-3</description>
                           <value>0b0010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>Divide-by-4</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0100</name>
                           <description>Divide-by-5</description>
                           <value>0b0100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>Divide-by-6</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0110</name>
                           <description>Divide-by-7</description>
                           <value>0b0110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>Divide-by-8</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1000</name>
                           <description>Divide-by-9</description>
                           <value>0b1000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>Divide-by-10</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1010</name>
                           <description>Divide-by-11</description>
                           <value>0b1010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1011</name>
                           <description>Divide-by-12</description>
                           <value>0b1011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1100</name>
                           <description>Divide-by-13</description>
                           <value>0b1100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>Divide-by-14</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1110</name>
                           <description>Divide-by-15</description>
                           <value>0b1110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1111</name>
                           <description>Divide-by-16</description>
                           <value>0b1111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="OUTDIV4" > <name>OUTDIV2</name> <description>Clock 2 Output Divider value</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="OUTDIV4" > <name>OUTDIV1</name> <description>Clock 1 Output Divider value</description> <bitOffset>28</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>FCFG1</name>
               <description>Flash Configuration Register 1</description>
               <addressOffset>0x104C</addressOffset>
               <resetValue>0xF00F0F00</resetValue>
               <resetMask>0xF0FFFFFF</resetMask>
               <fields>
                  <field>
                     <name>FLASHDIS</name>
                     <description>Flash Disable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash is enabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLASHDOZE</name>
                     <description>Flash Doze</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Flash remains enabled during Wait mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Flash is disabled for the duration of Wait mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PFSIZE</name>
                     <description>Program Flash Size</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0011</name>
                           <description>32 KB of program flash memory</description>
                           <value>0b0011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0101</name>
                           <description>64 KB of program flash memory</description>
                           <value>0b0101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b0111</name>
                           <description>128 KB of program flash memory</description>
                           <value>0b0111</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>256 KB of program flash memory</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FCFG2</name>
               <description>Flash Configuration Register 2</description>
               <addressOffset>0x1050</addressOffset>
               <access>read-only</access>
               <resetValue>0x800000</resetValue>
               <resetMask>0x80FFFFFF</resetMask>
               <fields>
                  <field>
                     <name>MAXADDR0</name>
                     <description>Max address block 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDH</name>
               <description>Unique Identification Register High</description>
               <addressOffset>0x1054</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDMH</name>
               <description>Unique Identification Register Mid-High</description>
               <addressOffset>0x1058</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDML</name>
               <description>Unique Identification Register Mid Low</description>
               <addressOffset>0x105C</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>UIDL</name>
               <description>Unique Identification Register Low</description>
               <addressOffset>0x1060</addressOffset>
               <access>read-only</access>
               <resetMask>0x0</resetMask>
               <fields>
                  <field>
                     <name>UID</name>
                     <description>Unique Identification</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLKDIV4</name>
               <description>System Clock Divider Register 4</description>
               <addressOffset>0x1068</addressOffset>
               <resetValue>0x10000000</resetValue>
               <fields>
                  <field>
                     <name>TRACEFRAC</name>
                     <description>Trace clock divider fraction</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRACEDIV</name>
                     <description>Trace clock divider divisor</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TRACEDIVEN</name>
                     <description>Debug Trace Divider Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Debug trace divider disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Debug trace divider enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>MISCTRL</name>
               <description>Miscellaneous Control Register</description>
               <addressOffset>0x106C</addressOffset>
               <fields>
                  <field>
                     <name>CMPWIN0SRC</name>
                     <description>CMP Sample/Window Input 0 Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 16</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP0 Sample/Window input is driven by both PDB0 and PDB1 pluse-out channel 0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB0 pluse-out channel 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB1 pluse-out channel 0</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPWIN1SRC</name>
                     <description>CMP Sample/Window Input 1 Source</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 17</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP1 Sample/Window input is driven by both PDB0 and PDB1 pluse-out channel 1</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB0 pluse-out channel 1</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB1 pluse-out channel 1</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPWIN2SRC</name>
                     <description>CMP Sample/Window Input 2 Source</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 18</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP2 Sample/Window input is driven by both PDB0 and PDB1 pluse-out channel 2</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB0 pluse-out channel 2</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB1 pluse-out channel 2</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMPWIN3SRC</name>
                     <description>CMP Sample/Window Input 3 Source</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 19</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>CMP3 Sample/Window input is driven by both PDB0 and PDB1 pluse-out channel 3</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB0 pluse-out channel 3</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB1 pluse-out channel 3</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EWMINSRC</name>
                     <description>EWM_IN Source</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>XBARA output 58</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>EWM_IN pin</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DACTRIGSRC</name>
                     <description>DAC0 Hardware Trigger Input Source</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>XBARA output 15</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>DAC0 can be triggered by both PDB0 interval trigger 0 and PDB1 interval trigger 0</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>PDB0 interval trigger 0</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>PDB1 interval trigger 0</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
