podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/SIM_MKV40F15.svd.xml
            <register>
               <name>MISCTRL2</name>
               <description>Miscellaneous Control Register 2</description>
               <addressOffset>0x1070</addressOffset>
               <fields>
                  <field>
                     <name>SYNCXBARAPITTRIG0</name>
                     <description>Synchronize XBARA&apos;s Input PIT Trigger 0 with fast clock</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable, bypass synchronizer</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCXBARAPITTRIG1</name> <description>Synchronize XBARA&apos;s Input PIT Trigger 1 with fast clock</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCXBARAPITTRIG2</name> <description>Synchronize XBARA&apos;s Input PIT Trigger 2 with fast clock</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCXBARAPITTRIG3</name> <description>Synchronize XBARA&apos;s Input PIT Trigger 3 with fast clock</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCXBARBPITTRIG0</name> <description>Synchronize XBARB&apos;s Input PIT Trigger 0 with fast clock</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCXBARBPITTRIG1</name> <description>Synchronize XBARB&apos;s Input PIT Trigger 1 with fast clock</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCDACHWTRIG</name> <description>Synchronize XBARA&apos;s output for DAC Hardware Trigger with flash/slow clock</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCEWMIN</name> <description>Synchronize XBARA&apos;s output for EWM&apos;s ewm_in with flash/slow clock</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCCMP0SAMPLEWIN</name> <description>Synchronize XBARA&apos;s output for CMP0&apos;s Sample/Window Input with flash/slow clock</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCCMP1SAMPLEWIN</name> <description>Synchronize XBARA&apos;s output for CMP1&apos;s Sample/Window Input with flash/slow clock</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCCMP2SAMPLEWIN</name> <description>Synchronize XBARA&apos;s output for CMP2&apos;s Sample/Window Input with flash/slow clock</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="SYNCXBARAPITTRIG0" > <name>SYNCCMP3SAMPLEWIN</name> <description>Synchronize XBARA&apos;s output for CMP3&apos;s Sample/Window Input with flash/slow clock</description> <bitOffset>23</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>WDOGC</name>
               <description>WDOG Control Register</description>
               <addressOffset>0x1100</addressOffset>
               <fields>
                  <field>
                     <name>WDOGCLKS</name>
                     <description>WDOG Clock Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Internal 1 kHz clock is source to WDOG2008</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>MCGIRCLK is source to WDOG2008</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PWRC</name>
               <description>Power Control Register</description>
               <addressOffset>0x1104</addressOffset>
               <resetValue>0x101</resetValue>
               <fields>
                  <field>
                     <name>SRPDN</name>
                     <description>Nanoedge Regulator 2.7V and 1.2V Supply Powerdown Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Nanoedge regulator placed in normal mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Nanoedge regulator placed in powerdown mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Nanoedge regulator placed in normal mode and SRPDN is write protected until chip reset</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Nanoedge regulator placed in powerdown mode and SRPDN is write protected until chip reset</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SR27STDBY</name>
                     <description>Nanoedge Regulator 2.7 V Supply Standby Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Nanoedge regulator 2.7 V placed in normal mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Nanoedge regulator 2.7 V placed in standby mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Nanoedge regulator 2.7 V supply placed in normal mode and SR27STDBY is write protected until chip reset</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Nanoedge regulator 2.7 V supply placed in standby mode and SR27STDBY is write protected until chip reset</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SR12STDBY</name>
                     <description>Nanoedge Regulator 1.2 V Supply Standby Control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Nanoedge regulator 1.2 V supply placed in normal mode</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Nanoedge regulator 1.2 V supply placed in standby mode</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Nanoedge regulator 1.2 V supply placed in normal mode and SR12STDBY is write protected until chip reset</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Nanoedge regulator 1.2 V supply placed in standby mode and SR12STDBY is write protected until chip reset</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRPWRDETEN</name>
                     <description>Nanoedge PMC POWER Dectect Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRPWRRDY</name>
                     <description>Nanoedge PMC POWER Ready</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not ready</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Assert PMC power output ready</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRPWROK</name>
                     <description>Nanoedge PMC Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Power supply for nanoedge isn&apos;t ready</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Power supply for nanoedge is OK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADCOPT</name>
               <description>ADC Channel 6/7 Mux Control Register</description>
               <addressOffset>0x1108</addressOffset>
               <fields>
                  <field>
                     <name>ADCACH6SEL</name>
                     <description>ADCA MUX0 selection for ADCA channel 6</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>ADCA MUX0&apos;s channel a</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>ADCA MUX0&apos;s channel b</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>ADCA MUX0&apos;s channel c</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>ADCA MUX0&apos;s channel d</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>ADCA MUX0&apos;s channel e</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>ADCA MUX0&apos;s channel g</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCACH7SEL</name>
                     <description>ADCA MUX1 selection for ADCA channel 7</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>ADCA MUX1&apos;s channel a</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>ADCA MUX1&apos;s channel b</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>ADCA MUX1&apos;s channel c</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>ADCA MUX1&apos;s channel e</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>ADCA MUX1&apos;s channel f</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>ADCA MUX1&apos;s channel g</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>PMC 1V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCBCH6SEL</name>
                     <description>ADCB MUX1 selection for ADCB channel 6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>ADCB MUX0&apos;s channel a</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>ADCB MUX0&apos;s channel b</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>ADCB MUX0&apos;s channel c</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>ADCB MUX0&apos;s channel d</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>ADCB MUX0&apos;s channel e</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>ADCB MUX0&apos;s channel f</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>ADCB MUX0&apos;s channel g</description>
                           <value>0b110</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b111</name>
                           <description>PMC 1V</description>
                           <value>0b111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCBCH7SEL</name>
                     <description>ADCB MUX1 selection for ADCB channel 7</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b000</name>
                           <description>ADCB MUX1&apos;s channel a</description>
                           <value>0b000</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b001</name>
                           <description>ADCB MUX1&apos;s channel b</description>
                           <value>0b001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b010</name>
                           <description>ADCB MUX1&apos;s channel c</description>
                           <value>0b010</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b011</name>
                           <description>ADCB MUX1&apos;s channel d</description>
                           <value>0b011</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b100</name>
                           <description>ADCB MUX1&apos;s channel e</description>
                           <value>0b100</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b101</name>
                           <description>ADCB MUX1&apos;s channel f</description>
                           <value>0b101</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b110</name>
                           <description>ADCB MUX1&apos;s channel g</description>
                           <value>0b110</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROSB</name>
                     <description>Enable ADC low current Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable ADC low current mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable ADC low current mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ADCIRCLK</name>
                     <description>ADC Clock Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>ADC clock is fast peripherial clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>ADC clock is MCGIRCLK</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
